In [ ]:
import pandas as pd
ratings_movies = pd.read_csv('C:/Users/U_M1P8G/Desktop/IDE/Python_for_data_analysis/Модуль_5/data/ratings_movies.csv', sep=',')

Для решения задач нам понадобится выделить из признака title год выпуска фильма. Для этого напишем функцию get_year_release(arg).

In [13]:
#библиотека для регулярных выражений
import re 
def get_year_release(arg):
    #находим все слова по шаблону "(DDDD)"
    candidates = re.findall(r'\(\d{4}\)', arg)
    # проверяем число вхождений
    if len(candidates) > 0:
        #если число вхождений больше 0,
	#очищаем строку от знаков "(" и ")"
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        #если год не указан, возвращаем None
        return None

In [14]:
ratings_movies['year_release'] = ratings_movies['title'].apply(get_year_release)
display(ratings_movies)

,Unnamed: 0,userId,movieId,rating,date,title,genres,year_release
0,0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995.0
1,1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance,1995.0
2,2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller,1995.0
3,3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995.0
4,4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995.0
...,...,...,...,...,...,...,...,...
100831,100831,610,166534,4.0,2017-05-03 21:53:22,Split (2017),Drama|Horror|Thriller,2017.0
100832,100832,610,168248,5.0,2017-05-03 22:21:31,John Wick: Chapter Two (2017),Action|Crime|Thriller,2017.0
100833,100833,610,168250,5.0,2017-05-08 19:50:47,Get Out (2017),Horror,2017.0
100834,100834,610,168252,5.0,2017-05-03 21:19:12,Logan (2017),Action|Sci-Fi,2017.0
100835,100835,610,170875,3.0,2017-05-03 21:20:15,The Fate of the Furious (2017),Action|Crime|Drama|Thriller,2017.0

In [16]:
ratings_movies['year_release'].isna().sum()

np.int64(18)

In [25]:
# Фильтруем фильмы 1999 года
ratings_movies_filtered = ratings_movies[ratings_movies['year_release'] == 1999]

# Группируем по названию и находим средний рейтинг
movie_ratings_1999 = (ratings_movies_filtered
                      .groupby('title')['rating']
                      .mean()
                      .sort_values(ascending=True))

# Выводим результат
print("Фильмы 1999 года с наименьшими средними оценками:")
print(movie_ratings_1999.head(10))

# Получаем фильм с наименьшей оценкой
lowest_rated_movie = movie_ratings_1999.index[0]
lowest_rating = movie_ratings_1999.iloc[0]

print(f"\nФильм с наименьшей средней оценкой: {lowest_rated_movie}")
print(f"Средняя оценка: {lowest_rating:.2f}")

Фильмы 1999 года с наименьшими средними оценками:
title
Bloodsport: The Dark Kumite (1999)                  0.500000
Chill Factor (1999)                                 1.000000
Source, The (1999)                                  1.000000
Simon Sez (1999)                                    1.000000
Julien Donkey-Boy (1999)                            1.000000
From Dusk Till Dawn 2: Texas Blood Money (1999)     1.000000
Trippin' (1999)                                     1.000000
Dudley Do-Right (1999)                              1.500000
Adventures of Elmo in Grouchland, The (1999)        1.500000
Eye of the Beholder (1999)                          1.583333
Name: rating, dtype: float64

Фильм с наименьшей средней оценкой: Bloodsport: The Dark Kumite (1999)
Средняя оценка: 0.50

In [49]:
ratings_movies_2010 = ratings_movies[ratings_movies['year_release'] == 2010]
ratings_movies_2010_groupby = ratings_movies_2010.groupby('genres')['rating'].mean().sort_values(ascending = True)
ratings_movies_2010_groupby

genres
Action|Sci-Fi                        1.000000
Action|Adventure|Horror              1.500000
Action|Drama|Fantasy                 1.500000
Crime|Romance                        1.500000
Adventure|Comedy|Fantasy             1.833333
                                       ...
Crime                                4.750000
Adventure|Children|Comedy|Mystery    5.000000
Animation|Children|Mystery           5.000000
Animation|Drama|Fantasy|Mystery      5.000000
Comedy|Musical                       5.000000
Name: rating, Length: 119, dtype: float64

In [52]:
ratings_movies.groupby('userId')['genres'].nunique().sort_values(ascending=False)

userId
599    524
414    482
448    403
380    399
474    395
      ...
578     15
494     15
214     13
245     13
85      13
Name: genres, Length: 610, dtype: int64

In [53]:
ratings_movies.groupby('userId', observed=False)['rating'].agg(
    ['count', 'mean']
).sort_values(by=['count', 'mean'], ascending=[True, False])

        count      mean
userId
53         20  5.000000
595        20  4.200000
189        20  4.100000
569        20  4.000000
278        20  3.875000
...       ...       ...
274      1346  3.235884
448      1864  2.847371
474      2108  3.398956
599      2478  2.642050
414      2698  3.391957

[610 rows x 2 columns]

In [60]:
pivot_table = ratings_movies[ratings_movies['year_release']==2018].groupby('genres')['rating'].agg(['count', 'mean']).sort_values(by = 'mean', ascending=False)
pivot_table[pivot_table['count']>10]

                         count      mean
genres
Action|Adventure|Sci-Fi     14  3.928571
Action|Comedy|Sci-Fi        12  3.875000

In [62]:
ratings_movies['year_rating']=pd.to_datetime(ratings_movies['date']).dt.year
ratings_movies['year_rating']

0         2000
1         2000
2         2000
3         2000
4         2000
          ...
100831    2017
100832    2017
100833    2017
100834    2017
100835    2017
Name: year_rating, Length: 100836, dtype: int32

In [67]:
pivot_1 = ratings_movies.pivot_table(
    values='rating',
    index='year_rating',
    columns='genres',
    observed=False,
    aggfunc='mean',
    fill_value=0
)

In [71]:
pivot_1['Action|Adventure'].min()

np.float64(3.2777777777777777)

In [ ]:
pivot_1['Action|Adventure|Animation|Children|Comedy|IMAX'].sort_values(ascending=False)

year_rating
2013    5.000000
2018    3.700000
2016    3.666667
2012    3.550000
2010    3.500000
2014    3.500000
2015    3.375000
2009    3.250000
2017    1.000000
2000    0.000000
2001    0.000000
1998    0.000000
1997    0.000000
1996    0.000000
1999    0.000000
2002    0.000000
2008    0.000000
2007    0.000000
2006    0.000000
2004    0.000000
2003    0.000000
2005    0.000000
2011    0.000000
Name: Action|Adventure|Animation|Children|Comedy|IMAX, dtype: float64

In [82]:
pivot_1.loc[2018]['Animation|Children|Mystery']

np.float64(5.0)

In [84]:
pivot_1['Comedy']

year_rating
1996    3.228571
1997    3.409091
1998    3.000000
1999    3.606061
2000    3.141291
2001    3.318408
2002    3.198556
2003    3.120066
2004    3.356877
2005    2.963325
2006    3.347534
2007    2.928187
2008    3.426667
2009    3.273292
2010    3.179825
2011    3.232877
2012    3.478477
2013    3.489474
2014    3.271429
2015    3.106183
2016    3.373431
2017    2.852668
2018    3.121296
Name: Comedy, dtype: float64

In [88]:
orders = pd.read_csv('C:/Users/U_M1P8G/Desktop/IDE/Python_for_data_analysis/Модуль_5/data/orders.csv', sep=';')
products = pd.read_csv('C:/Users/U_M1P8G/Desktop/IDE/Python_for_data_analysis/Модуль_5/data/products.csv', sep=';')

In [92]:
orders.head(5)

,Дата создания,Order ID,ID Покупателя,Статус,Оплачен,Отменен,Отгружен,ID товара,Количество
0,09.11.2019 21:55:51,9,10,"Принят, ожидается оплата",Нет,Нет,Нет,103,5
1,09.11.2019 15:05:57,8,9,"Принят, ожидается оплата",Нет,Нет,Нет,86,100
2,09.11.2019 15:05:57,8,9,"Принят, ожидается оплата",Нет,Нет,Нет,104,10
3,09.11.2019 12:50:07,7,8,"Принят, ожидается оплата",Нет,Нет,Нет,104,7
4,09.11.2019 12:00:00,6,1,"Принят, ожидается оплата",Нет,Нет,Нет,104,5

In [91]:
products.head(5)

   Product_ID                      Name  Price CURRENCY
0          47      Шатны Полосатый рейс   2999      RUR
1          51  Платье Аленький цветочек   4999      RUR
2          53    Штаны Цветочная Поляна   4999      RUR
3          71       Платье Ночная Жизнь   7999      RUR
4          74  Платье Ночная Жизнь XXXL   8999      RUR

In [94]:
orders_products = orders.merge(
    products,
    left_on ='ID товара',
    right_on='Product_ID',
    how='left'
)
orders_products.head(5)

,Дата создания,Order ID,ID Покупателя,Статус,Оплачен,Отменен,Отгружен,ID товара,Количество,Product_ID,Name,Price,CURRENCY
0,09.11.2019 21:55:51,9,10,"Принят, ожидается оплата",Нет,Нет,Нет,103,5,103.0,"Носки Подарочные, муж",199.0,RUR
1,09.11.2019 15:05:57,8,9,"Принят, ожидается оплата",Нет,Нет,Нет,86,100,86.0,"Носки Простые, муж",45.0,RUR
2,09.11.2019 15:05:57,8,9,"Принят, ожидается оплата",Нет,Нет,Нет,104,10,104.0,"Носки Подарочные, жен",249.0,RUR
3,09.11.2019 12:50:07,7,8,"Принят, ожидается оплата",Нет,Нет,Нет,104,7,104.0,"Носки Подарочные, жен",249.0,RUR
4,09.11.2019 12:00:00,6,1,"Принят, ожидается оплата",Нет,Нет,Нет,104,5,104.0,"Носки Подарочные, жен",249.0,RUR

In [95]:
orders_products[orders_products['Name'].isna()]

,Дата создания,Order ID,ID Покупателя,Статус,Оплачен,Отменен,Отгружен,ID товара,Количество,Product_ID,Name,Price,CURRENCY
17,01.01.2001 00:00:00,0,1,"Оплачен, формируется к отправке",Да,Нет,Нет,666,1,NaN,NaN,NaN,NaN

In [98]:
orders_products[orders_products['Статус'] == 'Отменён']
#orders_products['Статус'].value_counts()

,Дата создания,Order ID,ID Покупателя,Статус,Оплачен,Отменен,Отгружен,ID товара,Количество,Product_ID,Name,Price,CURRENCY
6,08.11.2019 08:36:22,5,5,Отменён,Нет,Да,Нет,124,1,124.0,Носки беговые Camino,999.0,RUR

In [106]:
orders_products_pay = orders_products[orders_products['Оплачен'] == 'Да'].copy()
orders_products_pay['income']=orders_products_pay['Количество']*orders_products_pay['Price']
orders_products_pay.sort_values(by = 'income', ascending=False).loc[:, ['ID Покупателя', 'income']]

    ID Покупателя  income
10              7  8999.0
14              5  7999.0
16              5  4999.0
11              7  4999.0
13              7  2999.0
9               8   747.0
8               8   597.0
12              7    99.0
15              5    45.0
17              1     NaN